[
	{
		"name": "Parkour Theory Data Pipeline",
		"auth": "Justin Chen", 
		"desc": "ETL data pipeline for the Parkour Theory data set. The system contains tasks for collecting video data, validating entities and relations, statistics, formatting type labels, and generating thumbnails and the site map for the Parkour Theory website. Preliminary results will be made available soon.",
		"href": "https://github.com/parkourtheory-admin/datapipe", 
		"year": "2020-Present"
	},
	{
		"name": "Parkour Theory",
		"auth": "Justin Chen, Parkour Community", 
		"desc": "Parkour Theory is a knowledge graph that enables users to disseminate, discover and reference parkour moves. Currently, I am working on formatting it into an academic data set consisting of relational, text and video data for multimodal, few-shot and graph representation learning.",
		"href": "http://parkourtheory.com/", 
		"year": "2014-Present"
	},
	{
		"name": "Pystagram", 
		"desc": "Python module for downloading Instagram videos", 
		"href": "https://github.com/ch3njust1n/pystagram", 
		"year": "2020"
	},
	{
		"name": "Current State of the Art in Machine Intelligence & Anime",
		"auth": "Justin Chen, Sonam Gosh",
		"desc": "Anime Boston 2020 was cancelled due to COVID-19. Our panel has been guaranteed acceptance for Anime Boston 2021.",
		"href": "https://www.animeboston.com/coninfo/schedule_panel/3574",
		"year": "2020",
		"venu": "Anime Boston, Sheraton - Gardener Room"
	},
	{
		"name": "Record",
		"desc": "A minimalistic Python 3 module for locally tracking experiment parameters.",
		"href": "https://github.com/ch3njust1n/record",
		"year": "2020"
	},
	{
		"name": "Current State-of-the-art Research & Artificial Intelligence in Anime",
		"auth": "Justin Chen, Sonam Gosh, Rex Wang",
		"desc": "For this panel, we updated our presentation to include advances from 2017 through 2019 and we demoed an interpolation of StyleGAN trained on Anime character faces.",
		"href": "https://www.animeboston.com/coninfo/schedule_panel/3218",
		"year": "2019",
		"venu": "Anime Boston, Hynes Workshop room 309"
	},
	{
		"name": "Machine Intelligence Community Knowledge Graph",
		"auth": "Justin Chen, Devin de Hueck",
		"desc": "Our project aspires to galvanize a virtuous cycle for democratizing machine intelligence educational content. The knowledge graph platform is an interface for creating and connecting education content and exploring the space of concepts in machine intelligence. Existing educational content mostly occupies the introductory region of knowledge space in the form of textbooks, blogs, videos and curriculums. However, the rest of that space is sparse or disconnected in research papers and academia. Explicitly defining a map over this space would further enable intensional discovery of new concepts and accelerate contribution to the field.",
		"href": "https://github.com/MICInc/knowledgegraph",
		"year": "2018 - 2019"
	},
	{
		"name": "Secure Multi-Party Learning",
		"auth": "Justin Chen, Frederick Jansen, Andrei Lapets", 
		"desc": "We implemented a distributed deep learning framework, which we call SMPL pronounced [sim-puh l] on top of PyTorch and a novel distributed gradient-based optimization, which we call Hypergraph Stochastic Gradient Descent (HGSGD) for applications to federated learning.", 
		"href": "https://github.com/ch3njust1n/smpl", 
		"year": "2018"
	},
	{
		"name": "Research Paper Summaries", 
		"desc": "Created presentations for Boston University Machine Intelligence Community's research paper discussions. Commits are under my old Github username levelicarus.", 
		"href": "https://github.com/bumic/summaries", 
		"year": "2017-2018"
	},
	{
		"name": "Boston University MIC Fundamentals of Deep Learning Workshop",
		"auth": "Justin Chen, Rex Wang, Mona Jalal, Ninad Tungare, Joe Sun, Charles Ma, Jinghu Lei, Duy Nguyen, Tyrone Hou, Chloe Kaubisch, Tammy Qiu, Brian Fakhoury", 
		"desc": "We created a semester-long workshop for Boston University Machine Intelligence Community's first Fundamentals of Deep Learning workshop.", 
		"href": "https://github.com/bumic/deeplearningseries-2017", 
		"year": "2017"
	},
	{
		"name": "Current State-of-the-art Research & Artificial Intelligence in Anime",
		"auth": "Justin Chen, Rex Wang",
		"desc": "This panel will highlight the differences between artificial intelligence portrayed in anime and the state of artificial intelligence research today. The presentation will cover a brief history, the state-of-the-art, the future of artificial intelligence, and how far we are today from some of the artificial intelligence technology in anime. The panelists will dissect and discuss the plausibility of artificial intelligence technologies from specific anime such as Ghost in the Shell, Ergo Proxy, and other anime. To wrap things up, there will be a live demonstration of Beating the World's Best at Super Smash Bros. with Deep Reinforcement Learning paper and real-time Neural Style Transfer.",
		"href": "https://www.animeboston.com/coninfo/schedule_panel/2280",
		"year": "2017",
		"venu": "Anime Boston, Hynes Workshop room 208"
	}
]